Documents/УведомлениеОПрекращенииПолномочийПредставителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УведомлениеОПрекращенииПолномочийПредставителя</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПредоставленииПолномочийПредставителю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияИлиСтрокаБРО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховательСотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентФизлицоИлиСтрокаБРО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительСотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганыПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВыгрузки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФИО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СубъектыДоверенностиСтрахователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СубъектыДоверенностиСтрахователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыСубъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СубъектыДоверенностиСтрахователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйНомерПФР</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКраткое</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УведомлениеОПрекращенииПолномочийПредставителя/Forms/ФормаВводаРеквизитовФЛ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Параметры.СтруктураДанных;
	
	Если СтруктураДанных.Свойство("ТолькоПросмотрФормы") И СтруктураДанных.ТолькоПросмотрФормы Тогда
		Элементы.ФИО.ТолькоПросмотр							= Истина;
		Элементы.Должность.ТолькоПросмотр					= Истина;
		Элементы.СНИЛС.ТолькоПросмотр						= Истина;
		Элементы.Телефон.ТолькоПросмотр						= Истина;
		Элементы.АдресЭлектроннойПочты.ТолькоПросмотр		= Истина;
		
		Элементы.ФормаКнопкаСохранить.Доступность			= Ложь;
	КонецЕсли;
	
	Если СтруктураДанных <> Неопределено И СтруктураДанных.Свойство("СтраховательСотрудник") Тогда
		ФИО												= СтруктураДанных.ФИО;
		Фамилия											= СтруктураДанных.Фамилия;
		Имя												= СтруктураДанных.Имя;
		Отчество										= СтруктураДанных.Отчество;
		Должность 										= СтруктураДанных.Должность;
		СотрудникСтрахователя							= Истина;
		Элементы.СНИЛС.Видимость						= Ложь;
		Элементы.Телефон.Видимость						= Ложь;
		Элементы.АдресЭлектроннойПочты.Видимость		= Ложь;
		Элементы.Должность.АвтоОтметкаНезаполненного	= Истина;
	ИначеЕсли СтруктураДанных <> Неопределено И СтруктураДанных.Свойство("ФИО") Тогда
		ФИО							= СтруктураДанных.ФИО;
		Фамилия						= СтруктураДанных.Фамилия;
		Имя							= СтруктураДанных.Имя;
		Отчество					= СтруктураДанных.Отчество;
		Должность 					= СтруктураДанных.Должность;
		СНИЛС 						= СтруктураДанных.СНИЛС;
		Телефон 					= СтруктураДанных.Телефон;
		АдресЭлектроннойПочты		= СтруктураДанных.АдресЭлектроннойПочты;
	КонецЕсли;
	
	Заголовок = СтруктураДанных.Заголовок;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ СохранениеВозможно() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ФИО",						ФИО);
	СтруктураДанных.Вставить("Фамилия",					Фамилия);
	СтруктураДанных.Вставить("Имя",						Имя);
	СтруктураДанных.Вставить("Отчество",				Отчество);
	СтруктураДанных.Вставить("Наименование",			ФИО);
	СтруктураДанных.Вставить("Должность",				Должность);
	СтруктураДанных.Вставить("СНИЛС",					СНИЛС);
	СтруктураДанных.Вставить("Телефон",					Телефон);
	СтруктураДанных.Вставить("АдресЭлектроннойПочты",	АдресЭлектроннойПочты);
	СтруктураДанных.Вставить("ЭтоЮридическоеЛицо",		Ложь);
	СтруктураДанных.Вставить("ФЛ",						Истина);
	
	Закрыть(СтруктураДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ФормаВводаФИО = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ФормаВводаФИО");
	
	ФормаВводаФИО.Фамилия 	= Фамилия;
	ФормаВводаФИО.Имя 		= Имя;
	ФормаВводаФИО.Отчество 	= Отчество;
	
	ФормаВводаФИО.ОписаниеОповещенияОЗакрытии =
		Новый ОписаниеОповещения("ФИОНачалоВыбораЗавершение", ЭтотОбъект);
	ФормаВводаФИО.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВводаФИО.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ФИООчистка(Элемент, СтандартнаяОбработка)
	
	Фамилия 	= "";
	Имя 		= "";
	Отчество 	= "";
	
	ФИО = "";
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СохранениеВозможно()
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(ФИО) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задано ФИО физического лица.'"),,
			"ФИО",, Отказ);
	КонецЕсли;
	
	Если СотрудникСтрахователя Тогда
		Элементы.Должность.АвтоОтметкаНезаполненного = Истина;
		Если НЕ ЗначениеЗаполнено(Должность) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задана должность физического лица.'"),,
				"Должность",, Отказ);
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(СНИЛС) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан СНИЛС физического лица.'"),,
				"СНИЛС",, Отказ);
		ИначеЕсли СтрДлина(СНИЛС) <> 14 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный СНИЛС физического лица.'"),,
				"СНИЛС",, Отказ);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Телефон) ИЛИ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
			Если НЕ ЗначениеЗаполнено(Телефон) И НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан телефон физического лица.'"),,
					"Телефон",, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) И НЕ ЗначениеЗаполнено(Телефон) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан адрес электронной почты физического лица.'"),,
					"АдресЭлектроннойПочты",, Отказ);
			ИначеЕсли ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ТекстОшибки = "";
				ЭлектроннаяПочта = СокрЛП(АдресЭлектроннойПочты);
				Если ДокументооборотСКОКлиентСервер.НайденыЗапрещенныеСимволы(
					ЭлектроннаяПочта,
					НСтр("ru = 'Адрес электронной почты '"),
					"АдресЭлектроннойПочты",
					Истина,
					ТекстОшибки) Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю((ТекстОшибки),,
						"АдресЭлектроннойПочты",, Отказ);
					
				ИначеЕсли НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(ЭлектроннаяПочта) Тогда
					
					Если НЕ СтрНайти(ЭлектроннаяПочта, "@") Тогда
						ОбщегоНазначенияКлиент.СообщитьПользователю(
							НСтр("ru = 'Некорректно указана электронная почта. Отсутствует символ @'"),,
							"АдресЭлектроннойПочты",, Отказ);
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(
							НСтр("ru = 'Электронная почта содержит некорректные сочетания символов'"),,
							"АдресЭлектроннойПочты",, Отказ);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо задать хотя бы один вид контактной информации.'"),,
				,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаКлиенте
Процедура ФИОНачалоВыбораЗавершение(РезультатРедактирования, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РезультатРедактирования) Тогда
		Возврат;
	КонецЕсли;
	
	Фамилия 	= РезультатРедактирования.Фамилия;
	Имя 		= РезультатРедактирования.Имя;
	Отчество 	= РезультатРедактирования.Отчество;
	
	ФИО = ДокументооборотСКОКлиентСервер.ПолучитьПредставлениеФИО(РезультатРедактирования);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
